app/controllers/top_controller.rb

SELECT  "articles".* FROM "articles" WHERE (released_at <= '2020-03-31 19:00:53.136282' AND ('2020-03-31 19:00:53.136282' < expired_at OR expired_at IS NULL)) ORDER BY "articles"."released_at" DESC LIMIT ?  [["LIMIT", 5]]
---
  def index
    @articles = Article.open.order(released_at: :desc).limit(5)